import math
from collections import deque
import heapq

n = int(input())

공간 = []
for _ in range(n):
    공간.append(list(map(int, input().split())))

현재_위치 = (-1, -1)
상어_사이즈 = 2
물고기_리스트 = []
for i in range(n):
    for j in range(n):
        if 공간[i][j] == 9:
            현재_위치 = (i, j)
        elif 공간[i][j] != 0:
            heapq.heappush(물고기_리스트, (공간[i][j], i, j))
공간[현재_위치[0]][현재_위치[1]] = 0

def 먹을_수_있는_물고기_구하기(물고기_리스트, 상어_사이즈):
    후보 = []
    for 물고기 in 물고기_리스트:
        if 물고기[0] < 상어_사이즈:
            후보.append(물고기)
        else:
            continue
    return 후보

def 최단_거리_구하기(공간, 현재_위치, 목표_위치, 상어_사이즈):
    q = deque()
    q.appendleft((0, 현재_위치[0], 현재_위치[1]))

    dx = [-1, 0, 1, 0]
    dy = [0, -1, 0, 1]
    visited = [[False] * n for _ in range(n)]

    while q:
        dist, x, y = q.popleft()
        visited[x][y] = True
        if x == 목표_위치[1] and y == 목표_위치[2]:
            return dist

        dist += 1
        for i in range(4):
            nx = x + dx[i]
            ny = y + dy[i]
            if 0 <= nx < len(공간) and 0 <= ny < len(공간) and 공간[nx][ny] <= 상어_사이즈 and not visited[nx][ny]:
                q.append((dist, nx, ny))
    return -1

def 가장_가까운_물고기(공간, 물고기_리스트, 현재_위치, 상어_사이즈):
    최소_좌표 = []
    for 물고기 in 물고기_리스트:
        거리 = 최단_거리_구하기(공간, 현재_위치, 물고기, 상어_사이즈)
        if 거리 != -1:
            최소_좌표.append((거리, 물고기[1], 물고기[2]))
    최소_좌표.sort()

    if len(최소_좌표) >= 1:
        최소_거리 = 최소_좌표[0][0]
        return [물고기 for 물고기 in 최소_좌표 if 물고기[0] == 최소_거리]
    else:
        return []

def 다음_위치_선정하기(공간, 물고기_리스트, 현재_위치, 상어_사이즈):
    # 갈 수 있는 사이즈 중에서 가장 가까운
    후보 = 먹을_수_있는_물고기_구하기(물고기_리스트, 상어_사이즈)
    후보 = 가장_가까운_물고기(공간, 후보, 현재_위치, 상어_사이즈)
    if len(후보) == 0:
        return (-1, -1, -1)

    후보.sort(key=lambda x:(x[1], x[2]))
    return 후보[0] # (거리, x, y)

time = 0
count = 0
while True:
    거리, 다음_위치_x, 다음_위치_y = 다음_위치_선정하기(공간, 물고기_리스트, 현재_위치, 상어_사이즈)
    if 거리 == -1:
        break

    time += 거리
    물고기_리스트.remove((공간[다음_위치_x][다음_위치_y], 다음_위치_x, 다음_위치_y))
    공간[다음_위치_x][다음_위치_y] = 0
    현재_위치 = (다음_위치_x, 다음_위치_y)

    count += 1
    if count >= 상어_사이즈:
        count -= 상어_사이즈
        상어_사이즈 += 1

print(time)

"""
# 0
3
0 0 0
0 0 0
0 9 0

# 3
3
0 0 1
0 0 0
0 9 0

# 14
4
4 3 2 1
0 0 0 0     
0 0 9 0
1 2 3 4

# 60
6
5 4 3 2 3 4
4 3 2 3 4 5
3 2 9 5 6 6
2 1 2 3 4 5
3 2 1 6 5 4
6 6 6 6 6 6

# 48
6
6 0 6 0 6 1
0 0 0 0 0 2
2 3 4 5 6 6
0 0 0 0 0 2
0 2 0 0 0 0
3 9 3 0 0 1

# 39
6
1 1 1 1 1 1
2 2 6 2 2 3
2 2 5 2 2 3
2 2 2 4 6 3
0 0 0 0 0 6
0 0 0 0 0 9

# 67
7
3 5 0 6 4 5 5
1 6 3 3 0 2 2
6 2 1 3 1 5 1
9 2 2 3 4 2 3
2 1 6 2 0 0 4
4 5 0 6 1 1 0
5 4 3 2 1 4 0

# 59
7
2 0 6 1 2 4 1
2 0 0 0 1 6 1
3 5 1 0 2 5 0
3 0 0 9 1 0 4
6 1 1 0 2 1 6
0 0 4 0 4 1 2
5 0 0 0 4 0 2

# 5
7
0 0 4 9 0 0 0
0 0 0 0 0 0 0
0 0 1 0 1 0 0
0 0 0 0 0 0 0
0 0 0 0 0 0 0
0 0 0 0 0 0 0
0 0 0 0 0 0 0

# 55
6
2 9 6 2 5 6
5 1 0 4 0 0
5 3 1 4 0 5
2 0 6 4 1 0
0 2 1 5 1 5
1 2 2 6 4 6 

# 48
6
0 4 4 3 0 6
0 0 3 5 4 2
1 4 1 3 6 2
0 0 2 1 9 0
1 3 5 4 6 0
2 5 6 2 1 0 

# 58
6
3 5 5 1 6 3
0 6 0 6 5 1
9 5 0 0 0 4
2 1 0 3 0 4
6 0 1 1 1 4
1 6 0 1 0 1

# 55
6
1 1 1 4 3 0
3 0 0 6 1 0
2 9 6 2 5 5
6 2 1 0 6 5
5 5 0 1 6 0
3 1 2 0 4 1

# 63
6
3 6 6 1 5 3
1 6 1 5 2 4
6 1 2 2 1 5
4 0 0 1 6 3
2 0 5 4 0 0
1 0 9 0 0 3

# 0
6
1 2 0 3 1 6
1 0 5 0 0 0
1 0 2 0 2 0
0 1 4 0 2 5
6 6 3 0 3 3
4 9 6 0 2 2

# 103
10
0 1 4 6 1 4 5 4 0 3
2 0 0 9 0 0 6 0 0 0
4 3 2 4 6 3 0 2 1 6
0 0 0 0 1 0 0 1 0 6
0 0 0 6 0 4 1 4 0 1
0 3 0 1 6 0 3 1 0 4
6 5 0 2 0 0 5 1 0 1
0 4 0 4 1 1 2 5 6 6
1 0 5 6 5 1 0 1 2 0
5 6 3 0 6 0 1 1 6 0

# 105
10
5 6 3 0 5 5 4 4 3 0
2 4 0 4 0 1 0 1 0 6
0 3 4 1 0 0 3 1 1 0
0 5 1 0 1 6 1 3 5 1
0 3 0 1 1 0 4 0 1 0
0 5 1 5 6 0 3 4 0 9
0 5 5 3 0 0 4 5 0 3
2 5 0 3 3 2 0 0 3 2
2 6 5 0 0 4 1 1 6 3
1 3 1 3 0 1 0 0 0 5

# 102
10
5 3 2 0 0 1 2 0 4 0
3 0 3 1 0 0 3 0 6 1
0 3 0 5 0 5 4 4 2 5
3 0 0 3 0 6 1 5 4 2
1 0 2 0 2 0 3 0 0 6
1 1 1 1 1 1 1 1 0 0
2 0 2 1 9 6 0 0 4 3
1 6 1 0 6 0 5 0 1 0
6 5 4 0 1 2 1 3 5 0
0 1 6 6 1 4 3 0 1 1 

# 87
10
2 0 2 0 1 1 1 0 1 0
0 4 4 0 4 0 0 0 3 0
4 3 5 0 1 0 2 6 0 0
0 0 5 5 3 1 3 1 3 4
6 0 5 1 4 2 4 0 5 0
0 0 5 0 2 1 1 2 1 0
2 0 5 2 4 0 9 1 6 2
4 1 2 0 3 0 3 2 4 6
3 0 1 0 4 0 0 5 0 1
0 4 1 1 6 6 1 6 0 0 

# 913
20
0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 2 3 3 4 4
0 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
9 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6
0 0 0 0 0 0 0 0 0 0 0 0 0 1 2 2 3 3 4 4
6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 4
"""